constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       22920;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       23320;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       43320;
    }
    overset
    {
        type            overset;
        inGroups        1(overset);
        nFaces          80;
        startFace       43400;
    }
    frontAndBack1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3200;
        startFace       43480;
    }
)

// ************************************************************************* //
